[
  {
    "id": 1,
    "name": "Apple MacBook Pro 17inch",
    "color": "Silver",
    "category": "Laptop",
    "price": 2999,
    "description": "Apple MacBook Pro 17inch"
  },
  {
    "id": 2,
    "name": "Microsoft Surface Pro",
    "color": "White",
    "category": "Laptop",
    "price": 1999,
    "description": "Microsoft Surface Pro"
  },
  {
    "id": 3,
    "name": "Magic Mouse 2",
    "color": "Black",
    "category": "Accessories",
    "price": 99,
    "description": "Magic Mouse 2"
  },
  {
    "id": 1747499011676,
    "name": "iPad",
    "price": 299,
    "color": "Silver",
    "category": "Laptop",
    "description": "iPad from Apple"
  },
  {
    "id": 1747560431118,
    "name": "Telsa",
    "price": 20000,
    "color": "Black",
    "category": "Laptop",
    "description": "dehaiuyhfeahuiifea"
  },
  {
    "id": 1747561824198,
    "name": "RTX4090",
    "price": 5000,
    "color": "Black",
    "category": "Gaming",
    "description": "The GeForce RTX 40 series is a family of consumer graphics processing units (GPUs) developed by Nvidia as part of its GeForce line of graphics cards, succeeding the GeForce RTX 30 series. The series was announced on September 20, 2022, at the GPU Technology Conference, and launched on October 12, 2022, starting with its flagship model, the RTX 4090.[1] It was succeeded by the GeForce RTX 50 series, which debuted on January 30, 2025,[3] after being previously announced at CES.[4]\n\nThe cards are based on Nvidia's Ada Lovelace architecture and feature Nvidia RTX's third-generation RT cores for hardware-accelerated real-time ray tracing, and fourth-generation deep-learning-focused Tensor Cores.\n\nDetails\nArchitectural highlights of the Ada Lovelace architecture include the following:[5]\n\nCUDA Compute Capability 8.9[6]\nTSMC 4N process (5 nm custom designed for Nvidia)[1] – not to be confused with N4\nFourth-generation Tensor Cores with FP8, FP16, bfloat16, TensorFloat-32 (TF32) and sparsity acceleration\nThird-generation Ray Tracing Cores, along with concurrent ray tracing, shading and compute\nShader Execution Reordering – needs to be enabled by the developer[7]\nDual NVENC with 8K 10-bit 120FPS AV1 fixed function hardware encoding[8][9]\nA new generation of Optical Flow Accelerator to aid DLSS 3.0 intermediate AI-based frame generation[10]\nNo NVLink support[11][12]\nDisplayPort 1.4a and HDMI 2.1 display connections\nDouble-precision (FP64) performance of Ada Lovelace silicon is 1/64 of single-precision (FP32) performance.\nRelease\nThe RTX 4090 was released as the first model of the series on October 12, 2022, for $1,599 US,[1] and the 16GB RTX 4080 was released on November 16, 2022, for $1,199 US. An RTX 4080 12GB was announced in September 2022, originally to be priced at $899 US, however following some controversy in the media it was \"unlaunched\" by Nvidia. On January 5, 2023, that model was released as the RTX 4070 Ti for $799 US. The RTX 4070 was then released on April 13, 2023 at $599 US MSRP. The RTX 4060 Ti was released on May 24, 2023, at $399 US, and the RTX 4060 on June 29, 2023, at $299 US. An RTX 4060 Ti 16GB followed on July 18, 2023, at $499 US. On January 8, 2024, Nvidia released the RTX 4070 Super at $599, RTX 4070 Ti Super at $799 and RTX 4080 Super at $999. These video cards were launched at higher specs and lower prices than their original counterparts.[13] In the same vein, the production of the RTX 4080 and RTX 4070 Ti have stopped due to the Super series, but the 4070 will remain.[14] In August 2024, Nvidia, citing the need \"to improve supply and availability\", introduced a variant of the RTX 4070 card with GDDR6 running at 20Gbps while all the other specs remain the same.[15][16]"
  }
]
